using System;
using System.Numerics;

/// @class Program
/// @brief Головний клас програми для роботи зі щасливими числами.
///
/// Дана програма дозволяє користувачу обрати один із варіантів:
/// - знайти щасливе число, яке змінюється 4 рази,
/// - знайти щасливе число, яке змінюється 7 разів,
/// - одразу отримати фінальну відповідь,
/// - завершити виконання програми.
///
/// Щасливими числами вважаються числа, що складаються лише з цифр 4 і 7,
/// та мають задану кількість переходів між різними цифрами.
class Program
{
    /// @brief Головний метод програми.
    ///
    /// Метод Main запускає консольне меню, яке працює у циклі.
    /// Користувач вводить число-команду, після чого програма:
    /// - виконує генерацію відповідного щасливого числа,
    /// - виводить його значення та позицію у списку,
    /// - або завершує роботу програми.
    ///
    /// Меню працює доти, доки користувач не введе 0.
    static void Main()
    {
        Console.WriteLine("Вітаю! Ця програма знаходить позицію щасливого числа і виводить її на екран");
        Console.WriteLine("Якщо ви хочете побачити щасливе число, яке буде мати змінну чисел 4 рази, введіть число 1");
        Console.WriteLine("Якщо ви хочете побачити щасливе число, яке буде мати змінну чисел 7 разів, введіть число 2");
        Console.WriteLine("Якщо хочете одразу перейти до відповіді, введіть число 3");
        Console.WriteLine("Якщо хочете завершити програму, введіть число 0");

        // Нескінченний цикл меню
        while (true)
        {
            // Перевірка правильності введених даних
            if (int.TryParse(Console.ReadLine(), out int choice))
            {
                switch (choice)
                {
                    /// @brief Виведення щасливого числа, яке змінюється 4 рази.
                    ///
                    /// Викликається генератор GenerateChangeNumbersFourTimes,
                    /// після чого програма показує знайдене число та його позицію.
                    case 1:
                        var resultFourTimes = GenerateChangeNumbersFourTimes.GenerateNumber();
                        Console.WriteLine($"Щасливе число яке змінюється чотири рази: {resultFourTimes.Item2}, Позиція: {resultFourTimes.Item1}");
                        break;

                    /// @brief Виведення щасливого числа, яке змінюється 7 разів.
                    ///
                    /// Викликається генератор GenerateChangeNumbersSevenTimes,
                    /// після чого виводиться знайдене число та його позиція.
                    case 2:
                        var resultSevenTimes = GenerateChangeNumbersSevenTimes.GenerateNumber();
                        Console.WriteLine($"Щасливе число яке змінюється сім разів: {resultSevenTimes.Item2}, Позиція: {resultSevenTimes.Item1}");
                        break;

                    /// @brief Виведення найщасливішого числа одразу.
                    ///
                    /// Програма одразу знаходить число, що змінюється 7 разів,
                    /// і виводить фінальну відповідь користувачу.
                    case 3:
                        var resultLuckySevenTimes = GenerateChangeNumbersSevenTimes.GenerateNumber();
                        var position = GenerateChangeNumbersSevenTimes.GenerateNumber();
                        Console.WriteLine($"Найщасливіше число: {resultLuckySevenTimes.Item2}, Позиція: {position.Item1}");
                        break;

                    /// @brief Завершення роботи програми.
                    ///
                    /// При введенні 0 програма виходить із циклу та завершує виконання.
                    case 0:
                        Console.WriteLine("Програма завершила свою роботу!");
                        return;

                    /// @brief Обробка неправильного вибору користувача.
                    ///
                    /// Якщо введене число не відповідає пунктам меню,
                    /// програма повідомляє про помилку.
                    default:
                        Console.WriteLine("Невірний вибір. Будь ласка, введіть правильне число.");
                        break;
                }
            }
            else
            {
                /// @brief Повідомлення про неправильний формат введення.
                ///
                /// Якщо користувач вводить не число, програма просить повторити введення.
                Console.WriteLine("Неправильний формат даних. Будь ласка, введіть число.");
            }
        }
    }
}
